# Найти факториалы чисел от 1 до 5 (включительно).

import math
for i in range(1, 6):
    print(f"{i}! = {math.factorial(i)}")

