# Напишите программу для вывода на экран чисел от 0 до 100

for i in range(1, 101, 1):
    print(i)

