# Вывести все числа от 1 до 100, которые делятся на 3 без остатка.

print(*[n for n in range(3, 100, 3)])
