# Дана сторона квадрата a. Найти его периметр P = 4·a

print(float(eval(input("сторона квадрата : ") + " * 4")), 'периметр P')