#Дана сторона квадрата a. Найти его площадь{{ S = a2}}

print(float(eval(input("сторона квадрата : ") + ' ** 2')), 'площадь S')