#Даны стороны прямоугольника a и b. Найти его площадь S = a·b и периметр P = 2·(a + b)

a = float(input("сторона прямоугольника a : "))
b = float(input("сторона прямоугольника b : "))

print(a * b, 'площадь S')
print(2 * (a + b), 'периметр P')