#Дан диаметр окружности d. Найти ее длину{{ L = π·d, π = 3.14}}

import math
print(float(eval(input("диаметр окружности : ") + " * math.pi")), 'длина L')