#Дана длина ребра куба a. Найти объем куба V = a3 и площадь его поверхности S = 6·a2

a = float(input("длина ребра куба : "))
print(a ** 3, 'объем куба V')
print(6 * (a ** 2), 'и площадь его поверхности S')