#Дана масса M в килограммах. Используя операцию деления нацело, найти количество полных тонн в ней (1 тонна = 1000 кг).

print(int(eval(input("масса M в килограммах : ") + " // 1000")), 'количество полных тонн в ней')